# Задача 2: Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

print("put 3 digit number: ")
a = int(input())
b = int(input())
c = int(input())
print("result: ")
print(a+b+c)
